Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་རྒྱས་དང་། འབྲས་བུ་ཆེ་བའི་ལྷ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ལྷའི་བུ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མ་ཐོས་པ་དང་། མ་བཟུང་བ་དང་། མ་བཅངས་པ་དང་། ཀུན་ཆུབ་པར་མ་བྱས་པ་དེ་དག་གིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཉན་པར་བྱའོ། །གཟུང་བར་བྱའོ། །བཅང་བར་བྱའོ། །ཀླག་པར་བྱའོ། །ཀུན་ཆུབ་པར་བྱའོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱའོ།
en: Kauśika, those gods of the Caturmahā­rāja­kāyika realm, situated throughout the world systems of the great trichiliocosm, along with those gods of the Trayastriṃśa realm, those of the Yāma realm, those of the Tuṣita realm, those of the Nirmāṇarata realm, those of the Para­nirmita­vaśa­vartin realm, those of the Ābhāsvara realms, those of the Śubhakṛtsna realms, and those of the Bṛhatphala realms, who have embarked upon unsurpassed, complete enlightenment, and those gods who have not yet heard, taken up, upheld, mastered, and focused their attention correctly on this perfection of wisdom should listen to, take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and they should not be separated from the mind set on all-aspect omniscience. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་མ་བྲལ་བར་བྱའོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་ཡང་མ་བྲལ་བར་བྱེད་ཅིང་དེ་དག་ནི་ཁྱིམ་སྟོང་པ་ན་འདུག་ཀྱང་རུང་། བླ་གབ་མེད་པ་ན་འདུག་ཀྱང་རུང་། ལམ་གོལ་པ་ན་འདུག་ཀྱང་རུང་སྟེ།
en: Moreover, Kauśika, if these noble sons or noble daughters take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and they are not separated from the mind set on all-aspect omniscience, they will not be afraid or terrified, whether they are staying in an empty hut, whether they are staying in an exposed place, or whether they have lost their way.

source: འཇིགས་པའམ་སྔང་བར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ནང་སྟོང་པ་ཉིད་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཤིན་དུ་བསྒོམས་སོ། །ཕྱི་སྟོང་པ་ཉིད་དང་།
en: If you ask why, it is because these noble sons and noble daughters have totally cultivated the emptiness of internal phenomena, without apprehending anything.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཤིན་དུ་བསྒོམས་སོ། །དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དང་། མཚེ་མ་དང་།
en: They have totally cultivated the emptiness of external phenomena, the emptiness of external and internal phenomena and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, without apprehending anything.”

source: དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། གནས་གཙང་མའི་རིས་ཀྱི་བར་གྱི་ལྷ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མོས་ཤིང་འཛིན་པ་དང་།
en: Then, at that time, all the gods situated throughout this world system of the great trichiliocosm—that is to say, the gods of the Caturmahā­rāja­kāyika realm, along with the gods of the Trayastriṃśa realm, those of the Yāma realm, those of the Tuṣita realm, those of the Nirmāṇarata realm, those of the Para­nirmita­vaśa­vartin realm, and those [of the other realms], up to and including the Pure Abodes—said to the Blessed One, “Blessed Lord, we shall always guard, nurture, and shelter, without interruption, those noble sons and noble daughters who observe, take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, teaching it extensively to others, and who focus their attention on all-aspect omniscience and are never separated from it. {

source: འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ཅིང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་སྟོན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡིད་ལ་བགྱིད་པ་དང་། མི་འབྲལ་བ་དེ་དག་ལ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བསྲུང་བ་དང་། བསྐྱང་བ་དང་།
en: Ki.

source: བསྐྱབ་པར་བགྱིའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆིས་ན། སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱང་རྒྱུན་ཆད་པར་འགྱུར། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་།
en: II-III: 38} If one were to ask why, Blessed Lord, it is because when bodhisattva great beings are present, rebirths among the denizens of the hells, as well as rebirths in the animal realm and the world of Yama, will be cut off, as will destitution among the gods.

source: གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་ལས་ཕོངས་པ་དང་། མི་ལས་དབུལ་བ་དང་། ནད་དང་གནོད་པ་དང་། འགོ་བའི་ནད་ཐམས་ཅད་ཀྱང་རྒྱུན་ཆད་ཅིང་འཇིག་པ་དང་མ་མཆིས་པར་འགྱུར།
en: Poverty among humans, and all epidemics, misfortunes, and contagious diseases, will also be cut off and brought to an end, or else will not occur.

source: མུ་གེའི་མྱ་ངམ་ཐམས་ཅད་ཀྱང་རྒྱུན་ཆད་པར་འགྱུར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆིས་ན།
en: All sorrow due to famine will be cut off too. “

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར། བསམ་གཏན་བཞི་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: Blessed Lord, when bodhisattva great beings are present, the ways of the ten virtuous actions will emerge in the world, and the four meditative concentrations will emerge in the world.

source: ཚད་མེད་པ་བཞི་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The four immeasurable attitudes will emerge in the world.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The four formless absorptions will emerge in the world.

source: མངོན་པར་ཤེས་པ་ལྔ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The five extrasensory powers will emerge in the world.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The perfection of generosity will emerge in the world.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom will emerge in the world.

source: ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: The emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, will emerge in the world.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, will emerge in the world. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆིས་ན། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་མཆིས་པར་འགྱུར། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་དང་།
en: When bodhisattva great beings are present, those of great and lofty royal families will be discerned.

source: ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་མཆིས་པར་འགྱུར།
en: Those of great and lofty priestly families, and those of great and lofty householder families will be discerned, as will imperial monarchs, the gods of the Caturmahā­rāja­kāyika realm, and the gods of [the other realms], up to and including Akaniṣṭha. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆིས་ན། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། རྒྱུན་དུ་ཞུགས་པ་མཆིས་པར་འགྱུར།
en: When bodhisattva great beings are present, the fruit of entering the stream to nirvāṇa and those individuals who enter the stream to nirvāṇa will be discerned.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་མཆིས་པར་འགྱུར།
en: The fruit of being destined for only one more rebirth and those individuals who are destined for only one more rebirth will be discerned.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བ་མཆིས་པར་འགྱུར།
en: The fruit of no longer being subject to rebirth and those individuals who are no longer subject to rebirth will be discerned.

source: དགྲ་བཅོམ་པ་ཉིད་དང་། དགྲ་བཅོམ་པ་མཆིས་པར་འགྱུར།
en: Arhatship and actual arhats will be present.

source: རང་བྱང་ཆུབ་དང་། རང་སངས་རྒྱས་མཆིས་པར་འགྱུར།
en: Individual enlightenment and pratyekabuddhas will be discerned. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆིས་ན། སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་མཆིས་པར་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་མཆིས་པར་འགྱུར།
en: When bodhisattva great beings are present, the maturation of beings will be discerned, the refinement of the buddhafields will be discerned, {Ki.

source: འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྱུང་བར་འགྱུར།
en: II-III: 39} and the tathāgatas, arhats, completely awakened buddhas will emerge in the world.

source: ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་མཆིས་པར་འགྱུར།
en: The turning of the wheel of the Dharma will be discerned.

source: སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་འབྱུང་བར་འགྱུར།
en: The precious jewel of the Buddha, the precious jewel of the Dharma, and the precious jewel of the Saṅgha will emerge. “

source: བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བསྲུང་བ་དང་།
en: Blessed Lord, as this formulation explains, we will ensure that bodhisattva great beings will be guarded, nurtured, and sheltered by the world with its gods, humans, and asuras.”

source: བསྐྱང་བ་དང་། བསྐྱབ་པར་བགྱིའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One then said to Śakra, mighty lord of the gods, “Kauśika, it is so!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན། སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: When bodhisattva great beings are present, rebirths among the denizens of the hells, rebirths in the animal realm, and those in all the worlds of Yama will be cut off.

source: །ལྷ་ལས་ཕོངས་པ་དང་། མི་ལས་དབུལ་བ་དང་། ནད་དང་གནོད་པ་དང་། འགོ་བའི་ནད་ཐམས་ཅད་རྒྱུན་ཆད་པ་དང་། འཇིག་པ་དང་མེད་པར་འགྱུར་རོ།
en: Destitute gods, human poverty, and all epidemics, misfortunes, and contagious diseases will be cut off, ended, and rendered nonexistent.

source: །མུ་གེའི་མྱ་ངན་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: All sorrow due to famine will be cut off. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: When bodhisattva great beings are present, the ways of the ten virtuous actions will emerge in the world.

source: །བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: The four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers will emerge in the world.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན།
en: The perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience will emerge in the world. “

source: རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་ཡོད་པར་འགྱུར་རོ། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་།
en: When bodhisattva great beings are present, those of great and lofty royal families will be discerned, as will those of great and lofty priestly families, and those of great and lofty householder families, imperial monarchs, the gods of the Caturmahā­rāja­kāyika realm, and the gods of [the other realms], up to and including Akaniṣṭha, will be discerned. “

source: འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཡོད་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་།
en: When bodhisattva great beings are present, the fruit of entering the stream to nirvāṇa and those individuals who enter the stream to nirvāṇa will be discerned.

source: རྒྱུན་དུ་ཞུགས་པ་ཡོད་པར་འགྱུར་རོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་ཡོད་པར་འགྱུར་རོ།
en: The fruit of being destined for only one more rebirth and those individuals who are destined for only one more rebirth will be discerned.

source: །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བ་ཡོད་པར་འགྱུར་རོ།
en: The fruit of no longer being subject to rebirth and those individuals who are no longer subject to rebirth will be discerned.

source: །དགྲ་བཅོམ་པ་ཉིད་དང་། དགྲ་བཅོམ་པ་ཡོད་པར་འགྱུར་རོ།
en: Arhatship and actual arhats will be discerned.

source: །རང་བྱང་ཆུབ་དང་རང་སངས་རྒྱས་ཡོད་པར་འགྱུར་རོ།
en: Individual enlightenment and pratyekabuddhas will be discerned. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན། སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཡོད་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོད་པར་འགྱུར་རོ། །འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འབྱུང་བར་འགྱུར་རོ།
en: When bodhisattva great beings are present, the maturation of beings will be discerned, the refinement of the buddhafields will be discerned, and the tathāgatas, arhats, completely awakened buddhas will emerge in the world.

source: །ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་ཡོད་པར་འགྱུར་རོ།
en: The turning of the wheel of the Dharma will be discerned.

source: །སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་དཀོན་མཆོག་འབྱུང་བར་འགྱུར་རོ།
en: The precious jewels of the Buddha, the Dharma, and the Saṅgha will emerge. “

source: །དེ་བས་ན་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རིམ་གྲོར་བྱའོ། །བཀུར་སྟི་དང་བསྟི་སྟང་དུ་བྱའོ། །མཆོད་པར་བྱའོ།
en: So it is that bodhisattva great beings should be honored, venerated, respected, and granted offerings by the world with its gods, humans, and asuras.

source: །རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་དེ་ལ་བསྲུང་བ་དང་། བསྐྱང་བ་དང་། བསྐྱབ་པར་བྱའོ།
en: You should guard, nurture, and shelter them, without interruption, at all times. “

source: །ཀཽ་ཤི་ཀ་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བར་སེམས་པ་དེ་ནི་ང་ལ་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་།
en: Kauśika, those who think that bodhisattva great beings should be honored, venerated, respected, and granted offerings are thinking that I should be honored, venerated, respected, and granted offerings.

source: མཆོད་པར་བྱ་བར་སེམས་སོ། །དེ་བས་ན་ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རིམ་གྲོར་བྱའོ། །བཀུར་སྟིར་བྱའོ།
en: Thus, bodhisattva great beings should be honored, venerated, respected, and granted offerings by the world with its gods, humans, and asuras. {

source: །བསྟི་སྟང་དུ་བྱའོ། མཆོད་པར་བྱའོ།
en: Ki.

source: །རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་དེ་ལ་བསྲུང་བ་དང་། བསྐྱང་བ་དང་། བསྐྱབ་པར་བྱའོ། །ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྟ་སྟེ་དཔེར་ན་འདམ་བུའི་ཚལ་ལམ། སྨྱིག་མའི་ཚལ་ལམ། བུ་རམ་ཤིང་གི་ཚལ་ལམ།
en: II-III: 40} You should guard, nurture, and shelter them, without interruption, at all times. “

source: འོད་མའི་ཚལ་ལམ། རྩི་སྐྱང་གི་བྱིངས་སམ། འབྲས་ཀྱི་ཞིང་ངམ། ཏིལ་གྱི་ཞིང་བཞིན་དུ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་གང་བར་གྱུར་ལ་དེ་དག་ལ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། ནམ་འཚོའི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱས་པ་དང་། བཀུར་སྟིར་བྱས་པ་དང་། བསྟི་སྟང་དུ་བྱས་པ་དང་། མཆོད་པར་བྱས་པ་བས། གང་ལ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་མ་བྲལ་བ་ཞིག་ལ། རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Kauśika, if this world system of the great trichiliocosm were filled entirely with śrāvakas or pratyekabuddhas, like a grove of reeds, like a grove of bamboo, like a grove of sugarcane, like a grove of canes, like a grove of broomsedge, like a paddy field of rice, or like a field of sesame, and if some noble sons or noble daughters were to honor, venerate, respect, and grant offerings to them, with all their necessities, for as long as they lived, but there was one who instead were to honor, venerate, respect, and grant offerings to a single bodhisattva great being, who had just experienced the initial setting of the mind on enlightenment and was not separated from the six perfections, that noble child would generate much greater merit.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཀཽ་ཤི་ཀ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དེ་དག་ཡོད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་བ་མ་ཡིན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་བ་མ་ཡིན་གྱི།
en: If you ask why, Kauśika, it is because, when there are śrāvakas and pratyekabuddhas, bodhisattva great beings will not emerge in the world and the tathāgatas, arhats, completely awakened buddhas will not emerge in the world.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་འཇིག་རྟེན་ན་ཡོད་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: Rather, Kauśika, it is when bodhisattva great beings are present that all śrāvakas and pratyekabuddhas are discerned in the world, and that the tathāgatas, arhats, completely awakened buddhas emerge in the world.

source: །ཀཽ་ཤི་ཀ་དེ་བས་ན་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རིམ་གྲོར་བྱའོ། །བཀུར་སྟིར་བྱའོ།
en: Kauśika, so it is that you should always ensure that bodhisattva great beings are honored, venerated, respected, and granted offerings by the world with its gods, humans, and asuras.

source: །བསྟི་སྟང་དུ་བྱའོ། །མཆོད་པར་བྱའོ། །རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་དེ་ལ་བསྲུང་བ་དང་། བསྐྱང་བ་དང་། བསྐྱབ་པར་བྱའོ།
en: You should guard, nurture, and shelter them, without interruption, at all times.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཅུ་དྲུག་པའོ།། །།དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་གིས། ཚེ་འདི་ལ་འཐོབ་པའི་ཡོན་ཏན་འདི་དག་ཡོངས་སུ་ཟིན་པར་འགྱུར་ཞིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བགྱིད་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བའི་སླད་དུ།
en: This completes the sixteenth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མཆི་བ་དང་། དགེ་བའི་རྩ་བ་གང་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་རིམ་གྲོར་བགྱི་བ་དང་། བཀུར་སྟིར་བགྱི་བ་དང་། བསྟི་སྟང་དུ་བགྱི་བ་དང་། མཆོད་པར་བགྱི་བར་འཚལ་བ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་།
en: Chapter 17 Then Śakra, mighty lord of the gods, said to the Blessed One, “Blessed Lord, how wonderful it is that bodhisattva great beings who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will acquire these attributes that may be attained in this lifetime, and that in order to bring beings to maturation, to refine the buddhafields, and to venerate the lord buddhas, they move from buddhafield to buddhafield, and that the roots of virtuous action through which they seek to honor, venerate, respect, and make offerings to those lord buddhas will also become excellent! [

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་གང་ཐོས་པ་དེ་དག་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མ་གྱུར་གྱི་བར་དུ་དྲན་པ་མི་ཉམས་པ་དང་། རིགས་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ་དང་། སྐྱིད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། ཚེ་ཕུན་སུམ་ཚོགས་པ་དང་། འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། མཚན་ཕུན་སུམ་ཚོགས་པ་དང་། འོད་ཕུན་སུམ་ཚོགས་པ་དང་། མིག་ཕུན་སུམ་ཚོགས་པ་དང་།
en: How wonderful it is that] the Dharmas that they heard from those lord buddhas they will remember without defect until they attain consummate buddhahood in unsurpassed, complete enlightenment, that they will acquire the excellence of the spiritual family, and that they will acquire the excellence of felicity, the excellence of longevity, the excellence of retinue, the excellence of defining characteristics, the excellence of luminosity, the excellence of eyes, the excellence of voice, the excellence of meditative stability, and the excellence of dhāraṇī! {

source: དབྱངས་ཕུན་སུམ་ཚོགས་པ་དང་། ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ་དང་། གཟུངས་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ་དང་། ཐབས་མཁས་པས་བ་དག་ཀྱང་། སངས་རྒྱས་ཀྱི་སྐུར་མངོན་པར་སྤྲུལ་ཅིང་། འཇིག་རྟེན་གྱི་ཁམས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སུ་མངོན་པར་མཆི་བ་དང་། གང་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐྱེ་ཞིང་འབྱུང་བར་མ་གྱུར་བ་དེ་དང་དེ་དག་དུ་མཆིས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོན་ཏན་རྗོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཡོན་ཏན་རྗོད་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཡོན་ཏན་རྗོད་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་ཡོན་ཏན་རྗོད་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་།
en: Ki.
